Repository: fparaggio/BoneClamp
Catalog: xi-bone/comedilib/doc/po/*.po
Languages: de

source: usage: comedi_config [OPTIONS] <device file> [<driver> <opt1>,<opt2>,...] OPTIONS: -v, --verbose verbose output -q, --quiet quiet output -V, --version print program version -i, --init-data <filename> Use file for driver initialization data, typically firmware code. -r, --remove remove previously configured driver --read-buffer <size> set buffer size in kilobytes used for reading --write-buffer <size> set buffer size in kilobytes used for writing <optN> are integers whose interpretation is driver dependent. In general, for PCI boards, <opt1> and <opt2> refer to the bus/slot indices of the board. If not specified, a board will automatically be chosen. For non-PCI boards, <opt1> specifies the I/O port base address and, if applicable, <opt2> specifies the IRQ. Additional options may be useful, see the Comedi documentation for details.
de: Benutzung: comedi_config [OPTION] <Gerätdatei> [<Treiber> <opt1>,<opt2>,...] -v, --verbose verbose output -q, --quiet quiet output -V, --version Zeige Versionsnummer an. -i, --init-data <Datei> -i, --init-data <Datei> Use file for driver initialization data, typically firmware code. -r, --remove remove previously configured driver --read-buffer <size> set buffer size in kilobytes used for reading --write-buffer <size> set buffer size in kilobytes used for writing <optN> sind Ganzzähle, dessen Bedeutung treiberabhängig ist. Typisch, für PCI Geräte, <opt1> und <opt2> sind die PCI Bus- und Schlitz- Nummern von dem Gerät. Wann die Nummern unspezifiziert oder null sind, ein Gerät wird automatisch wählen. Für non-PCI Geräte, <opt1> spezifiziert the I/O port base address und <opt2> gegebenenfalls die IRQ. Zusätliche Optionen kann auch nützlich sein; lesen die Dokumentation für weiterer Information.

source: comedi_config should be run as root. Attempting to continue anyway.
de: comedi_config wirt bei root fahren sollen. Versuche jedenfalls zu weitermachen.

source: invalid buffer size
de: ungültige Puffergröße

source: device not configured
de: Gerät nicht konfiguriert

source: modprobe problem
de: modprobe Fehler

source: Check kernel log for more information
de: Prüfen die Kernaufzeichnung für weiterer Information

source: Already configured
de: schon konfiguriert

source: Driver not found
de: Treiber nicht gefunden

source: Not root
de: nicht root

source: Comedi bug
de: Fehler mit Comedi

source: Unknown
de: ungültig

source: Buffer resizing requires Comedi version >= 0.7.57
de: Puffergrößänderung erfordert Comedi Versionnummer >= 0.7.57

source: warning: no read subdevice, resize ignored
de: Warnung: kein Leseuntergerät, Puffergrößänderung ignoriert

source: buffer resize error
de: Puffergrößänderungsfehler

source: warning: no write subdevice, resize ignored
de: Warnung: kein Schreibuntergerät, Puffergrößänderung ignoriert

source: No error
de: keine Fehler

source: Unknown error
de: ungültige Fehler

source: Bad comedi_t structure
de: schlechte comedi_t Structur

source: Invalid subdevice
de: ungültiges Untergerät

source: Invalid channel
de: ungültige Kanal

source: Buffer overflow
de: Pufferüberlauf

source: Buffer underflow
de: Pufferunterlauf

source: Command not supported
de: Befehl nicht unterstützt

source: Not supported
de: nicht unterstützt
